In [1]:
import pandas as pd
import numpy as np
from datetime import datetime, date

In [16]:
s = pd.Series(np.random.randn(9), index=[
    ['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
    [1,2,3,4,5,6,7,2,1]
])
s

a  1    1.928129
   2   -0.142151
   3   -0.294897
b  4    0.495670
   5    0.779467
c  6   -1.213331
   7   -0.771869
d  2    0.860613
   1   -0.935845
dtype: float64

In [22]:
type(s.index)

pandas.core.indexes.multi.MultiIndex

In [23]:
s.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 4),
            ('b', 5),
            ('c', 6),
            ('c', 7),
            ('d', 2),
            ('d', 1)],
           )

In [17]:
s['a'][1]

1.9281289462490545

In [18]:
s[:2]

a  1    1.928129
   2   -0.142151
dtype: float64

In [21]:
s.loc[:,[1,2]]

a  1    1.928129
   2   -0.142151
d  2    0.860613
   1   -0.935845
dtype: float64

In [24]:
s.unstack()

          1         2         3        4         5         6         7
a  1.928129 -0.142151 -0.294897      NaN       NaN       NaN       NaN
b       NaN       NaN       NaN  0.49567  0.779467       NaN       NaN
c       NaN       NaN       NaN      NaN       NaN -1.213331 -0.771869
d -0.935845  0.860613       NaN      NaN       NaN       NaN       NaN

In [26]:
s.unstack().stack()

a  1    1.928129
   2   -0.142151
   3   -0.294897
b  4    0.495670
   5    0.779467
c  6   -1.213331
   7   -0.771869
d  1   -0.935845
   2    0.860613
dtype: float64

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 4),
            ('b', 5),
            ('c', 6),
            ('c', 7),
            ('d', 8),
            ('d', 9)],
           )

In [51]:
# DataFrame
frame = pd.DataFrame(np.random.rand(12).reshape(4,3), 
                    index=[['apple', 'apple', 'kiwi', 'lychee'],
                          [0,1,2,3]],
                    columns=[['foo', 'bar', 'bar'],[0,1,2]])

In [48]:
frame.index.names = ['col1', 'col2']

In [49]:
frame.columns.names = ['row1', 'row2']

In [50]:
frame

row1              foo       bar
row2                0         1         2
col1   col2
apple  0     0.561030  0.467478  0.539534
       1     0.265869  0.994275  0.315778
kiwi   2     0.041923  0.977696  0.281090
lychee 3     0.146081  0.461270  0.093099

In [38]:
frame.loc['apple','bar'][2][0]

0.5395340507831479

In [45]:
frame.loc[['apple', 'kiwi'], ['bar']]

              bar
                1         2
apple 0  0.467478  0.539534
      1  0.994275  0.315778
kiwi  2  0.977696  0.281090

In [43]:
frame.loc[['apple', 'kiwi'], ['bar'][0]]

                1         2
apple 0  0.467478  0.539534
      1  0.994275  0.315778
kiwi  2  0.977696  0.281090